{
  "recipes": [
    {
      "link": "https://www.vegansociety.com/lifestyle/recipes/black-forest-cherry-cake",
      "title": "Black forest cherry cake",
      "ingredients": [
        "6 oz (170g) plain flour",
        "6 oz (170g) sugar",
        "2 oz (55g) cocoa",
        "1 tsp bicarbonate of soda",
        "1/2 tsp salt",
        "1 tsp vanilla essence",
        "1 tsp cider vinegar",
        "4 fl oz (110ml) vegetable oil",
        "8 fl oz (230ml) water"
      ],
      "method": [
        "Preheat oven to 190C/375F/gas mark 5.",
        "Mix together all the dry cake ingredients.",
        "Make a well in the centre and add all the wet ingredients except the water. Gradually add the water and mix until smooth. Do not over mix.",
        "Line an 8 inch round cake tin with greased greaseproof paper and pour in the mixture.",
        "Bake in the centre of the pre-heated oven for 35-40 minutes. Test with a cake skewer before removing (it should come out clean).",
        "Allow to cool for 10 minutes then remove from tin and cool on a wire rack. Cut into 3 layers when cool."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/special-occasions/beetroot-soup",
      "title": "Beetroot soup",
      "ingredients": [
        "500g raw beetroot",
        "2 sticks celery",
        "1 large red onion",
        "1 clove garlic",
        "3 tbsp olive oil",
        "1/2 tsp ground cumin",
        "A pinch of dried red chilli flakes",
        "Freshly ground black pepper, to taste",
        "1 tbsp red wine vinegar",
        "50ml vodka (optional)",
        "850ml vegan stock",
        "400ml coconut milk"
      ],
      "method": [
        "Top and tail the beetroot, then peel it under cold running water. Cut each one into eight roughly equal pieces. Cut the celery into thick slices. Peel the onion and cut it into eight pieces. Peel the garlic and chop it roughly. Put all these ingredients into a large saucepan, add the olive oil and stir to coat the vegetables. Cook the vegetables over a medium heat for 10 minutes, stirring occasionally. Add the cumin, chilli flakes and a generous twist of black pepper and continue to cook for a further 10 minutes.",
        "Pour the vinegar and vodka (optional) into the pan, stir the vegetables well and continue to cook until the moisture in the pan has evaporated away. Add the stock and bring the mixture to the boil. Then lower the heat, put a lid on the pan and simmer for an hour, checking and stirring regularly. Use the point of a sharp knife to check that the beetroot is tender, then take the pan off the heat and allow the soup to cool.",
        "Transfer the soup to a blender or food processor and blend until very smooth. Return it to the saucepan, pour in the coconut milk and reheat, stirring continuously. Check the seasoning and consistency – if you would like a thinner soup, add a little more water."
      ]
    },
    {
      "link": "https://www.vegansociety.com/get-involved/campaigns/vegan-thriving/vegan-thriving-recipes/black-beanball-marinara-subs",
      "title": "Black beanball marinara subs",
      "ingredients": [
        "2 tins black beans, drained",
        "1 clove garlic",
        "1 carrot, peeled and grated",
        "1 red onion, finely diced",
        "50 g frozen peas",
        "20 g chia seeds",
        "50 g gram (chickpea) flour",
        "1 tbsp chopped fresh coriander",
        "Black pepper, to taste"
      ],
      "method": [
        "Put the ingredients for the black bean meatless balls into a food processor and pulse to combine. Divide into 30 g balls and place into an ovenproof dish, leaving space between each ball.",
        "Put all of the sauce ingredients into a saucepan and bring to a simmer. Cook for 5 minutes and season.",
        "Mix the sweet potato wedges with the oil and smoked paprika and place onto a lined baking sheet.",
        "Pour the sauce over the meatless balls and place them and the wedges into an oven preheated to 180°C. Cook until the wedges are coloured and soft and the meatless balls are firm.",
        "Serve the meatless balls in the subs with the sweet potato wedges. These also go great with wholemeal spaghetti."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/special-occasions/banana-bread-donuts",
      "title": "Banana bread donuts",
      "ingredients": [
        "1/3 cup (55g) buckwheat flour",
        "1/3 cup (60g) brown rice flour",
        "1/3 cup (45g) tapioca flour",
        "2 tbsp almond flour",
        "1 tsp baking powder",
        "1/2 tsp bicarbonate soda",
        "1/2 tsp salt",
        "1/2 tsp cinnamon",
        "1/4 tsp ground ginger",
        "1 tbsp flax seeds + 2 tbsp water",
        "1/3 cup (80ml) unsweetened almond milk",
        "1 large ripe banana, peeled (155g)",
        "5 soft, pitted medjool dates (110g)",
        "2 tbsp maple syrup",
        "2 tbsp coconut butter",
        "1 tsp cider vinegar"
      ],
      "method": [
        "Firstly, make the flax egg. Add the flax seeds and water into a bowl and stir them together. Then set them aside to gel.",
        "Next, add the rice flour, buckwheat flour, tapioca flour, almond flour, baking powder, bicarbonate of soda, salt, cinnamon and ginger into a large mixing bowl and stir them together. Set aside.",
        "Then, melt the coconut butter and add it into a blender with the almond milk, banana, dates, maple syrup and cider vinegar. Blend until smooth. When the mixture is smooth, add it into the mixing bowl alongside the flax egg. Using a hand whisk, mix everything together until smooth.",
        "Spoon the mixture into 9 donut moulds, and move the donuts into the oven to bake for about 20 minutes or so, until golden. When the donuts have cooked, remove them from the oven and set them aside to cool.",
        "While the donuts cool, make the caramel. Add the coconut oil, salt, maple syrup and pecans into a pan and place onto a medium-high heat. Allow the mixture to bubble and heat through for about 2 minutes, stirring it with a spatula. Each time the mixture completely bubbles, briefly remove it from the heat to calm quickly before adding it back onto the heat. When this is done, remove it from the heat and allow it to cool for a minute or so and thicken.",
        "Lastly, when the caramel has cooled, stir it together if necessary, and then spoon it on top of each donut to finish. Then serve."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/special-occasions/balsamic-roasted-new-potatoes-asparagus",
      "title": "Balsamic roasted new potatoes with asparagus",
      "ingredients": [
        "2 tbsp garlic-infused olive oil",
        "4 tbsp balsamic vinegar",
        "1kg new potatoes (such as Jersey Royal or another small waxy variety), cut into quarters",
        "250g asparagus tips, cut in half",
        "A generous pinch of salt and pepper"
      ],
      "method": [
        "Preheat oven to 200C.",
        "In a large roasting tin, add the olive oil, balsamic vinegar and salt. Add the potatoes and toss to coat fully before roasting for 30 minutes.",
        "After 30 minutes, add the asparagus with a little extra olive oil, if needed. Toss to coat and cook for a further 10 minutes.",
        "Season with extra balsamic vinegar, salt and pepper.",
        "Serve and enjoy!"
      ]
    },
    {
      "link": "https://www.vegansociety.com/lifestyle/recipes/banana-berry-smoothie",
      "title": "Banana berry smoothie",
      "ingredients": [
        "4 bananas",
        "4 handfuls frozen berries of choice",
        "1.2 litres soy milk",
        "4 teaspoons cinnamon"
      ],
      "method": [
        "Get out your blender or food processor.",
        "Add all of the ingredients and blend until smooth."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/cakes-meringues-and-desserts/banana-chocolate-cake",
      "title": "Banana chocolate cake",
      "ingredients": [
        "6 1/2 oz (185g) plain flour",
        "1 1/2 oz (45g) cocoa",
        "1 tsp bicarbonate of soda",
        "1 tsp baking powder",
        "5 oz (140g) sugar",
        "2 tbsp soya flour",
        "1/4 pint (140ml) vegetable oil",
        "1/4 pint (140ml) water",
        "2 very ripe bananas, mashed 6oz (170g) flesh"
      ],
      "method": [
        "Preheat oven to 160C/325F/gas mark 3.",
        "Beat all the ingredients together and place in a 7 inch round cake tin, greased and floured.",
        "Bake for 30-35 minutes in the pre-heated oven."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/special-occasions/blackbun",
      "title": "Blackbun",
      "ingredients": [
        "10 oz (283g) self raising flour",
        "1 tsp salt",
        "4 oz (113g) vegan margarine",
        "Soya milk to bind"
      ],
      "method": [
        "First make the shortcrust pastry. Add all dry ingredients, rub in margarine and then bind with the milk.",
        "To make the filling mix all the filling ingredients together.",
        "Roll out pastry into a large rectangle. Line middle of pastry with filling and roll up into a big 'sausage'. Bake in medium / hot oven for half an hour."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/cakes-meringues-and-desserts/berry-muffins",
      "title": "Berry muffins",
      "ingredients": [
        "160g hard coconut oil",
        "3/4 cup (175ml) medjool date paste (make it here)",
        "1 tsp ground vanilla beans",
        "2 flax eggs (2 tbsp flaxseed meal + 5 tbsp warm water)",
        "1 3/4 cups (231g) self-raising flour",
        "2/3 cup (150ml) soy milk",
        "1 cup (175g) mixed berries"
      ],
      "method": [
        "Preheat oven to 170 degrees Celsius and prepare a cupcake tin with 12 medium cupcake wrappers.",
        "In a medium sized bowl using electric beaters, beat coconut oil until smooth.",
        "Add date paste and beat for 2 minutes or until well combined.",
        "Add vanilla beans and flax eggs and mix until smooth.",
        "Add flour and soy milk and fold into mixture.",
        "Pour batter into prepared cupcake cases.",
        "Bake for approximately 25 minutes or until the cupcakes are firm and well risen.",
        "Ice if desired, and enjoy!"
      ]
    },
    {
      "link": "https://www.vegansociety.com/get-involved/campaigns/vegan-thriving/vegan-thriving-recipes/baked-thai-spiced-vegetables",
      "title": "Baked Thai-spiced vegetables",
      "ingredients": [
        "1 courgette, cut into thick slices",
        "2 heads pak choi, quartered through the root",
        "6 spring onions, cut in half",
        "150 g baby sweetcorn",
        "3 mixed peppers, cut into chunks",
        "2 red onions, sliced through the root",
        "100 g tenderstem broccoli",
        "150 g edamame beans",
        "100 ml water",
        "200 g Thai curry paste (red/green/yellow)",
        "200 g brown basmati rice (dry weight), cooked, to serve"
      ],
      "method": [
        "Mix the courgettes, pak choi, spring onions, baby sweetcorn, peppers, red onion, broccoli and edamame beans together. Mix the water with the Thai curry paste and mix into the vegetables.",
        "Put the veg into an ovenproof container with a lid and put into a preheated oven on a medium heat.",
        "When the veg is tender, portion up and serve with the brown basmati rice."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/cakes-meringues-and-desserts/banana-bread",
      "title": "Banana bread",
      "ingredients": [
        "8 very ripe bananas",
        "3/4 cup (252g) maple syrup",
        "1/3 cup (76g) coconut oil (melt if it’s cold and hard)",
        "1 cup (250ml) unsweetened plain almond milk",
        "1/4 cup (43g) chia seeds",
        "1 tbsp apple cider vinegar",
        "1 tbsp vanilla extract"
      ],
      "method": [
        "Preheat oven to 325 degrees Fahrenheit or 140-160 degrees Celsius.",
        "In a large bowl, mash 6 bananas until smooth. Stir in remaining wet ingredients; set aside.",
        "In a large bowl, combine all dry ingredients except coconut. Add dry ingredients to wet ingredients; stir until fully combined. Stir in coconut.",
        "Divide batter evenly between prepared loaf tins, smoothing out tops. Top each loaf with slices of remaining 2 bananas. Bake for 45 to 55 minutes, until a skewer inserted in center comes out clean. Cool in pan for 5 minutes before transferring to a wire rack to cool completely.",
        "Store loaves well-covered in the fridge (if they make it that far!)"
      ]
    },
    {
      "link": "https://www.vegansociety.com/lifestyle/recipes/bean-stew",
      "title": "Bean stew",
      "ingredients": [
        "Vegetable oil for frying",
        "1 small onion, finely chopped",
        "75g dried peas and beans, soaked overnight",
        "1 dssp dried lentils",
        "1 carrot, diced",
        "1 small parsnip, diced",
        "1 dssp tomato puree",
        "1/2 tsp mixed herbs",
        "500ml vegetable stock",
        "15g plain flour"
      ],
      "method": [
        "Fry onion lightly in vegetable oil. Add remaining ingredients except flour, bring to the boil, and simmer gently for approximately 1 hour until vegetables are cooked.",
        "Add 1 tbsp cold water to flour and mix to a paste. Add this to stew and cook for few minutes until it thickens. Puree or serve as it is if child is older."
      ]
    },
    {
      "link": "https://www.vegansociety.com/lifestyle/recipes/banana-pancakes",
      "title": "Banana pancakes",
      "ingredients": [
        "1 banana",
        "1 tablespoon sunflower oil, plus extra to oil the pan",
        "1 teaspoon lemon juice",
        "1/2 teaspoon ground cinnamon",
        "100 grams plain flour",
        "1/2 teaspoon baking powder",
        "400 milliliters soya milk",
        "maple syrup, to serve"
      ],
      "method": [
        "In a mixing bowl, mash the banana with a fork and whisk in the oil, lemon juice and cinnamon. Add the flour and baking powder. Stir while gradually adding the soya milk. The batter will take on the consistency of yogurt.",
        "Place a frying pan on a medium heat. Oil it using a little sunflower oil on a scrunched piece of kitchen towel. Drop tablespoon-fuls of batter onto the pan and swirl so it spreads across the surface. When bubbles pop and the glossiness of the pancake becomes matte (about two minutes), flip over. Cook for a further couple of minutes.",
        "Place the finished pancakes on a plate. Repeat the process until the batter is used up. Serve hot with maple syrup."
      ]
    },
    {
      "link": "https://www.vegansociety.com/get-involved/campaigns/vegan-thriving/vegan-thriving-recipes/beetroot-steak-bearnaise-style-sauce",
      "title": "Beetroot steak with Bearnaise-style sauce",
      "ingredients": [
        "6 large beetroots, halved and cut into very fine slices",
        "2 large carrots, peeled and ribboned with a peeler",
        "2 large parsnips, peeled and ribboned with a peeler",
        "50 g reduced fat vegan margarine",
        "4 flat mushrooms",
        "Black pepper, to taste",
        "250 ml soya cream",
        "200 g calcium-set tofu",
        "100 ml water",
        "1 red onion, finely diced",
        "1 clove garlic, pureed",
        "1 tbsp cornflour",
        "1 tbsp water",
        "1 tbsp chopped fresh tarragon",
        "100 g tenderstem broccoli, steamed",
        "4 sweet potatoes, made into wedges or baked"
      ],
      "method": [
        "Lay the beetroot slices out into four rows of equal length so that each slice overlaps the next. Top each row equally with the carrot ribbons. Top again equally with the parsnip ribbons.",
        "Carefully starting at one end, roll up trying to keep it as tight as possible to form a pinwheel. Wrap the circumference of each roll in tinfoil to secure it (or you can use metal cooking rings if you have them).",
        "Melt the vegan spread in a frying pan big enough to fit all 4 beetroot steaks. Add the steaks and cook over a low to medium heat. Turn after 5 minutes and repeat. Then, place the steaks onto a lined baking sheet and put the mushrooms onto the same sheet. Using the residual margarine in the pan, brush the mushrooms and season. Bake in the oven on 180 °C for 15 minutes until the mushrooms are cooked and tender."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/gluten-free/banana-ice-cream",
      "title": "Banana ice cream",
      "ingredients": [
        "6 bananas",
        "1 fl oz (25ml) lemon juice",
        "18 fl oz (2 x 250ml) soya custard",
        "9 fl oz (250ml) soya milk"
      ],
      "method": [
        "Slice bananas and put into container with lemon juice. Freeze for four hours or overnight.",
        "Blend the custard and milk with the frozen fruit in a food processor. Return to container and freeze until needed. Take out of the freezer 20 minutes before serving."
      ]
    },
    {
      "link": "https://www.vegansociety.com/lifestyle/recipes/beet-bourguignon-nut-roast",
      "title": "Beet Bourguignon nut roast",
      "ingredients": [
        "2tbsp olive oil",
        "150g shallots or red onions, finely chopped",
        "30g garlic cloves, finely chopped",
        "40g sun dried tomatoes, roughly chopped",
        "120ml red wine, red grape juice or cranberry juice can be used for an alcohol-free version",
        "200g beetroot, finely grated and juice squeezed out",
        "3g thyme stalks, remove and discard stalks",
        "2tsp stock powder",
        "1tsp salt, more if needed",
        "1tsp yeast extract or brown miso",
        "40g ground flax seed",
        "100g pre-cooked chestnuts",
        "70g hazelnuts, roughly chopped",
        "60g shallots or red onions, finely sliced",
        "20g sunflower seeds",
        "1tbsp olive oil"
      ],
      "method": [
        "Heat your oven to 200c/gas mark 6 (fan oven 180c)",
        "Heat 2tbsp in a wide frying pan on a medium heat, once hot add the shallots or red onions, cook until they are soft. Add the garlic, cook for a further 5 minutes until the garlic starts to brown.",
        "Add the sundried tomatoes, wine (or juice), beetroot, thyme, stock, salt and yeast extract. Mix well and taste to see if any more salt is needed.",
        "Add flax seeds and mix well.",
        "Crush the chestnuts using a rolling pin, you want there to be chunks of the nuts to add texture to the nut roast.",
        "Add the hazelnuts and chestnuts to the beetroot mixture.",
        "In a small bowl mix the shallots or red onions and sunflower seeds with oil.",
        "Put a ramekin into the middle of the cake tin. Add the onion mixture to the cake tin so it goes around the ramekin to make a ring. Top with the beetroot mixture, pat down with the back of a spoon.",
        "Bake for around 30-40 minutes until the outside has crisped up. Run a knife around the edge of the nut roast, place a plate on top then flip over.",
        "Fill in the inner circle of the nut roast with celeriac mash and roasted rainbow root veg or serve in separate dishes."
      ]
    },
    {
      "link": "https://www.vegansociety.com/take-action/campaigns/vegan-thriving/vegan-thriving-recipes/bombay-burritos",
      "title": "Bombay Burritos",
      "ingredients": [
        "Curry mashed potatoes",
        "450 g baby potatoes, cut into quarters",
        "1 tbsp olive oil",
        "½ tsp salt",
        "1 tsp cumin powder",
        "1 tsp coriander powder",
        "½ tsp turmeric powder",
        "½ tsp ground ginger",
        "¼ tsp mustard powder",
        "Pinch of pepper and cayenne powder",
        "1 tsp granulated onion or granulated garlic powder"
      ],
      "method": [
        "Preheat the oven to 215°C.",
        "Cut the potatoes and place them in a medium pot. Cover them with water and simmer until tender, for about 15–20 minutes. Keep the skins on the potatoes if you prefer, for added texture.",
        "Cut the cauliflower into small florets and place them on one half of a lined sheet pan. Add the drained chickpeas to the other side. Drizzle both with olive oil, sprinkle the cauliflower and chickpeas with the spices and salt and toss to coat well. Place in the oven and roast for 20–25 minutes (tossing halfway through) or until cauliflower is tender.",
        "Once the potatoes are tender, drain the water and coat with the olive oil, salt and spices before placing them on an oven tray or in an ovenproof dish. Put them in the oven for around 20 minutes.",
        "Bring out the potatoes, cauliflower and chickpeas and mix them all together.",
        "Warm your tortillas in the oven for a few minutes while allowing the mixture to cool slightly before moving on to assembling your burritos.",
        "Take your tortillas out of the oven and add a handful of spinach leaves to the tortilla before adding the mix on top. Finish by adding a few sliced pickled onions and then roll up like a burrito.",
        "You can also refrigerate and reheat for meals on the go."
      ]
    },
    {
      "link": "https://www.vegansociety.com/lifestyle/recipes/beetroot-pumpkin-lentil-rainbow-falafel",
      "title": "Beetroot & pumpkin lentil rainbow falafel",
      "ingredients": [
        "1 cup (180g) red lentils (3 cm short of a mug)",
        "water",
        "1 large onion",
        "1 tbsp oil",
        "1/2 cup fresh herbs (e.g. parsley, coriander)",
        "4 cloves garlic",
        "2 tbsps ground flaxseed",
        "4-5 tsps ras el hanout spice (depending on how spicy you want to make them!)",
        "½ tsp smoked paprika",
        "1 tsp sea salt (or more to your taste)",
        "1/4 tsp black pepper (or more to your taste)",
        "3 tbsps plain flour (gluten-free flour, if necessary)",
        "1.5 tbsps beetroot mashed",
        "1.5 tbsps pumpkin mashed"
      ],
      "method": [
        "Peel pumpkin and beetroot and cut into rough chunks, approx. 3 cm square. Roast in the oven at 180C on separate baking trays, until tender and can be mashed. Use them to add to the mix at step 8.",
        "Measure out your lentils, place them in a colander and rinse under cold water for a couple of minutes, until the water runs clear - this is to remove some of the starch from the lentils, which can make them a bit mushy when cooked.",
        "In a medium-sized saucepan, put the washed lentils and enough water to cover them by at least 2 - 2.5 cm. You are going to cook them, but not all the way through, as we need them to be still slightly firm to start.",
        "Bring the lentils to the boil over a high heat, then reduce the heat to low and simmer (without a lid), for about 4-5 minutes. The lentils should be slightly undercooked, not soft and mushy. (Whilst you are waiting for the lentils to cook, you can start peeling and chopping the vegetables – see step 4). Drain and rinse the lentils under cold water in a colander, and set aside to cool.",
        "Add oil to a frying pan and gently fry the garlic and onion until soft.",
        "Pick the fresh herb leaves off their stems, and measure out ½ cup of leaves.  Really pack the leaves into the ½ cup (a mug is fine if you don’t have a measuring cup).",
        "Add the lentils, garlic, onion, fresh herbs, flaxseed, ras el hanout, paprika and salt and pepper to a food processor or blender. Pulse, using on/off pulses, until finely chopped, but not a paste.  You may need to carefully scrape the sides and bottom of the food processor/blender bowl a few times in between pulses, so that the mixture is evenly chopped.",
        "Scrape the mixture into 2 separate mixing bowls. Add mashed pumpkin to one bowl, and mashed beetroot to the other, so that you have one bowl of orange mixture and one of purple mixture.",
        "Stir in 1.5 tbsps of plain flour into each bowl, until it is all blended. Taste the mixture and add more salt and pepper, ras el hanout or paprika depending on your taste.",
        "Preheat your oven to 190 C.",
        "Shaping the falafel balls: get your baking tray ready, by lining it with baking paper, and brushing the paper lightly with some vegetable oil. Make small falafel balls of approx. ping pong ball size in each colour – orange and purple. Place each finished ball on the baking sheet on your baking tray, leaving at least 1.5cm gap between them.",
        "Once all the balls are shaped and on the baking tray, place the tray in the preheated oven and bake for 12 -14 minutes or until they start to become golden and crisp on the outside. If they are still slightly moist, put them back in the oven again for another 2-4 minutes.  Once the balls are golden brown and the surface appears dry, you can remove the tray from the oven.",
        "Serving options are endless - the falafels taste great with a piece of pita bread or in a salad!"
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/special-occasions/bbq-meat-loaf",
      "title": "BBQ 'Meat' Loaf",
      "ingredients": [
        "150g (1½ cups) sweet potato, cubed",
        "250g (9oz) portobello mushrooms",
        "2 tbsp olive oil",
        "1 onion, finely chopped",
        "3 garlic cloves, minced",
        "1 red (bell) pepper, diced",
        "2 tsp dried sage",
        "2 tsp dried rosemary",
        "2 tsp dried thyme",
        "1 tsp cayenne pepper",
        "125g (1 cup) walnuts, finely chopped",
        "50g (1 cup) panko breadcrumbs",
        "1 x 400-g (14-oz) can chickpeas (garbanzos), drained",
        "Zest of 1 lemon",
        "Sea salt and black pepper"
      ],
      "method": [
        "Preheat your oven to 180°C (350°F). Line a medium-sized loaf tin with greaseproof paper. Steam the sweet potato until the flesh is soft. Add the mushrooms to a blender and blitz until they are finely chopped.",
        "Place a large non-stick saucepan over a medium heat. Add the oil and, when hot, add the mushrooms. Sauté them for around 5 minutes so that you get rid of some of the water inside them and get them nicely golden.",
        "Next add the onion, garlic and red (bell) pepper to the pan, plus the herbs, spices and a pinch each of sea salt and black pepper. Sauté the mixture for a further 5 minutes, stirring often.",
        "When you’ve got a nice colour on everything, add the sweet potato. Sauté the mix for a few more minutes before adding the breadcrumbs, chopped walnuts, chickpeas (garbanzos) and lemon zest. Stir until all the ingredients are well combined. Turn the heat off, then use a potato masher to lightly mash the mix, breaking down any large chunks of sweet potato and the chickpeas. Spoon the mixture into your lined loaf tin, compacting it in as much as you can. Place the ‘meat’ loaf on the bottom shelf of your oven and let it roast for 40 minutes.",
        "Meanwhile, make that lovely BBQ glaze. Add all the ingredients to a small saucepan with a pinch each of salt and pepper and mix well. Place over a low heat and allow it to bubble away for around 10 minutes. Stir every now and then. Once your glaze has thickened, turn off the heat and set aside until the ‘meat’ loaf is cooked.",
        "Once your ‘meat’ loaf has been in the oven for 40 minutes, take that baby out. Let it stand for around 10 minutes before placing a flat baking sheet on top. Carefully, while holding the tray in place with one hand and the loaf tin with the other, turn the tray upside down so that the ‘meat’ loaf comes out.",
        "Lift off the loaf tin and peel off any greaseproof paper that has stuck. Pour lashings of the BBQ glaze over the ‘meat’ loaf, then place the tray back into the oven for a further 10 minutes so that the glaze caramelizes over the loaf. Serve immediately, topped with cherry tomatoes and sautéed sage leaves."
      ]
    },
    {
      "link": "https://www.vegansociety.com/resources/recipes/cakes-meringues-and-desserts/banana-ice-cream",
      "title": "Banana ice cream",
      "ingredients": [
        "4 very ripe bananas"
      ],
      "method": [
        "Slice the bananas, put into a covered container and freeze for at least 12 hours. Allow to thaw for 5 minutes before processing in a food processor until light and whippy-like.",
        "Serve with chopped nuts, nut cream, chocolate chips or your other favourite toppings. serves 2-3."
      ]
    }
  ]
}